Final/Day 2/03 todo/app/controllers/todos_controller.rb

SELECT * FROM "lists" WHERE ("lists"."id" = 2)
---
  def index
    @todos = Todo.find(:all)
    @list = List.find(params[:list_id])

SELECT * FROM "todos" WHERE ("todos"."id" = 953125641)
---
  def show
    @todo = Todo.find(params[:id])

SELECT * FROM "todos" WHERE ("todos"."id" = 953125641)
---
  def edit
    @todo = Todo.find(params[:id])

INSERT INTO "todos" ("updated_at", "title", "due_by", "list_id", "note", "complete", "created_at") VALUES('2009-02-27 01:04:30', 'My Todo', NULL, NULL, NULL, NULL, '2009-02-27 01:04:30')
---
  def create
    @list = List.find(params[:list_id])
    @todo = @list.todos.new(params[:todo])

    respond_to do |format|
      if @todo.save

SELECT * FROM "todos" WHERE ("todos"."id" = 953125641)
UPDATE "todos" SET "note" = 'I am a todo. OMG an edit@!', "updated_at" = '2009-02-26 23:59:19' WHERE "id" = 1
---
  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])

SELECT * FROM "todos" WHERE ("todos"."id" = 953125641)
DELETE FROM "todos" WHERE "id" = 953125641
---
  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy